import React from 'react';
import './aboutPage.scss'
import AboutImg_1 from "../../Assets/Images/about_img_1.jpg";
import AboutImg_2 from "../../Assets/Images/about_img_2.jpg";
import {Link} from "react-router-dom";
import {Button} from "antd";
import TopBanner from "../../Components/TopBanner/TopBanner.jsx";

const AboutPage = ({banner}) => {
    return (
        <div className='wrapper'>
            <div className="about">

                {banner ?
                    <TopBanner/>
                    :
                    <></>
                }

                <div className="aboutContent">
                    <div>
                        <h2>Про нас</h2>
                        <p>Ласкаво просимо до <b>спільноти взаємодопомоги «Обмінюй з користю» </b> – простору,
                            де люди допомагають одне одному, обмінюються речами, знаннями та послугами без зайвих
                            витрат. Ми віримо, що речі можуть отримати друге життя, а підтримка та взаємодія між людьми
                            здатні змінити світ на краще.</p>
                        <p>У сучасному світі споживання ми часто стикаємося з проблемою надлишку речей, які займають
                            місце, але більше нам не потрібні. Водночас багато людей шукають те, що в нас просто
                            припадає пилом. <b>Ми хочемо об'єднати тих, хто готовий ділитися, і тих, хто потребує
                                допомоги!</b></p>
                        <p>Наш проєкт створений для того, щоб зробити процес обміну максимально простим, зручним і
                            безпечним. У нас ви зможете знайти все: від одягу та книг до послуг і товарів для дому. Ми
                            прагнемо створити середовище, де <b>кожен може отримати необхідне, не витрачаючи зайвих
                                коштів</b>, а також знайти нових друзів і однодумців.</p>
                    </div>
                    <div className='ourMission silver'>

                        <div className="image"><img className='img_1' src={AboutImg_1} alt="Наша місія"/></div>
                        <div>
                            <h4>Наша місія</h4>

                            <p>🌍 Зменшення відходів та екологічна свідомість</p>
                            <p>Щороку мільйони тон речей опиняються на звалищах, хоча багато з них могли б ще довго
                                слугувати іншим. Ми хочемо змінити цей підхід і зробити обмін речами більш популярним.
                                Адже передаючи речі далі, ми не тільки допомагаємо іншим, а й піклуємося про навколишнє
                                середовище.</p>
                            <p>🤝 Формування культури взаємодопомоги</p>
                            <p>Наше суспільство стає все більш цифровим, і часто ми втрачаємо зв’язок із людьми навколо.
                                Ми прагнемо повернути довіру між людьми, створити середовище, де кожен може отримати
                                допомогу або допомогти іншим.</p>
                            <p>💰 Економія ресурсів</p>
                            <p>Не завжди варто купувати нове – іноді достатньо знайти тих, хто готовий поділитися. Це
                                допомагає заощаджувати гроші та водночас позбуватися непотрібних речей із користю.</p>
                            <p>🏡 Створення спільноти однодумців</p>
                            <p>Ми – не просто сайт обміну, а справжня спільнота людей, які цінують раціональне
                                використання ресурсів, допомогу іншим та чесний обмін.</p>
                        </div>

                    </div>

                    <div className="help">
                        <h4>Наша історія успіху: як ми допомагаємо людям обмінювати речі та змінювати життя</h4>
                        <p>За останні 2 роки ми допомогли передати вже більше 10000 речей – від одягу та книг до
                            побутової техніки й меблів. Це не просто цифри, а історії реальних людей, які змогли знайти
                            потрібні речі, позбутися зайвого та зробити свій внесок у спільноту взаємодопомоги.</p>
                        <p>Кожен день до нашої платформи долучаються нові користувачі, які хочуть не лише отримати щось
                            корисне для себе, а й допомогти іншим. Ми бачимо, як багато людей змінюють своє ставлення до
                            речей, усвідомлюючи, що замість того, щоб щось викидати, можна передати тим, хто цього
                            справді потребує. Це не лише допомагає економити гроші, а й зменшує кількість відходів, що
                            робить наше суспільство більш екологічно відповідальним.</p>
                        <p>Завдяки активності нашої спільноти, багато сімей отримали можливість облаштувати свої
                            домівки, діти – знайти іграшки та книжки, а студенти – навчальні матеріали та техніку для
                            навчання. Ми часто отримуємо повідомлення подяки від людей, яким наша платформа допомогла
                            знайти необхідні речі в складний момент життя. Наприклад, молода родина, яка тільки-но
                            переїхала в нове житло, змогла знайти безкоштовні меблі та посуд, що значно полегшило їхній
                            побут.</p>
                        <p>Одна з головних переваг нашої платформи – це простота використання. Ми зробили процес обміну
                            максимально зручним, щоб кожен міг швидко розмістити оголошення про речі, які хоче передати,
                            та знайти те, що потрібно. Крім того, наша спільнота активно підтримує чесність і
                            відкритість – завдяки взаємодії між користувачами формується атмосфера довіри, що робить
                            обмін ще ефективнішим.</p>
                        <p>Наш проєкт також має вагомий соціальний вплив. Ми неодноразово ставали частиною благодійних
                            ініціатив, допомагаючи нужденним і підтримуючи малозабезпечені сім’ї. Часто користувачі
                            нашої платформи передають не лише непотрібні речі, а й спеціально віддають нові або майже
                            нові предмети тим, кому вони зараз найбільше потрібні. Це справжній приклад того, як
                            взаємодопомога може змінювати життя людей.</p>
                    </div>

                    <div className='transfer silver'>

                        <div className="image"><img className='img_1' src={AboutImg_2} alt="Наша місія"/></div>
                        <div>
                            <h4>Що найбільше передають люди?</h4>

                            <p>📚 Книги та навчальні матеріали – завдяки обміну літературою, студенти та школярі
                                отримують потрібні підручники, а любителі читання можуть знаходити нові цікаві
                                історії.</p>
                            <p>👗 Одяг і взуття – дитячий, дорослий, сезонний, святковий – усе це передається між людьми,
                                економлячи їхні кошти та ресурси.</p>
                            <p>🏠 Меблі та побутові речі – багато людей отримали столи, стільці, шафи, які раніше просто
                                припадали пилом у когось удома.</p>
                            <p>📱 Електроніка – смартфони, ноутбуки, навушники, гаджети знаходять нових власників і
                                продовжують працювати.</p>
                            <p>🎲 Іграшки та дитячі речі – передані від однієї родини до іншої, вони радують дітей і
                                зменшують витрати батьків.</p>
                        </div>

                    </div>

                    <div className="geo">
                        <h4>Ди ми знаходимось?</h4>
                        <p>Наша локальна точка розташовується за адресою вул. Юрія Ільєнка, 38, м. Київ. Туди можна
                            принести речі й передати їх у добрі руки. Ми створили це місце, щоб кожен бажаючий міг легко
                            та без зайвих клопотів віддати непотрібні, але ще придатні до використання речі тим, хто їх
                            потребує.</p>
                        <p>У нашій точці прийому можна залишити одяг, взуття, книги, побутові речі, іграшки та навіть
                            невеликі меблі. Всі речі проходять сортування, після чого їх передають людям, які опинилися
                            в складних життєвих обставинах, малозабезпеченим сім’ям, студентам або просто тим, хто шукає
                            корисні предмети для свого дому.</p>
                        <p>Ми прагнемо зробити процес передачі максимально простим: ви приносите речі, а наша команда
                            або волонтери допомагають знайти їм нових власників. У такий спосіб ви не лише позбуваєтесь
                            зайвого, а й даруєте комусь радість і можливість отримати потрібні речі безкоштовно.</p>
                        <p>Запрошуємо всіх завітати до нашої точки взаємодопомоги! Разом ми можемо зробити світ трохи
                            кращим, підтримуючи культуру обміну та відповідального споживання.</p>
                        <iframe
                            src="https://www.google.com/maps/embed?pb=!1m14!1m8!1m3!1d1306.9069251941844!2d30.46528610992488!3d50.470828534863024!3m2!1i1024!2i768!4f13.1!3m3!1m2!1s0x40d4cdc54452da15%3A0x6f9bad339af5049e!2z0YPQuy4g0K7RgNC40Y8g0JjQu9GM0LXQvdC60L4sIDM4LCDQmtC40LXQsiwgMDIwMDA!5e0!3m2!1sru!2sua!4v1742174835441!5m2!1sru!2sua"
                            width="100%"
                            height="500"
                            style={{border: 0}}
                            allowFullScreen
                            loading="lazy"
                            referrerPolicy="no-referrer-when-downgrade"
                        />

                    </div>

                    <div className="login">
                        <h4>Приєднуйся до нас!</h4>
                        <p>Стати частиною нашої спільноти легко – <Link to={'/login'}>реєструйся</Link>, та знаходь
                            однодумців! <Button style={{color:'#fff'}} href={'/login'} type='primary'>Зареєструватись</Button></p>
                        <p>Разом ми зробимо світ кращим, відповідальнішим і добрішим.</p>
                        <p>Якщо потрібні коригування чи інші акценти – повідом! 😊</p>
                    </div>
                </div>
            </div>
        </div>
    );
};

export default AboutPage;